/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@, %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; dáta = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NULA>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "Kompromitovanie AA";

/* Label of field in authority info access extension */
"Access Location" = "Miesto prístupu";

/* Label of field in authority info access extension */
"Access Method" = "Metóda prístupu";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "Zmenená afiliácia";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "Algoritmus";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "Sériové číslo certifikátu autority";

/* Authority info access extension label */
"Authority Information Access" = "Prístup k informáciám autority";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "Identifikátor kľúča autority";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "Základné obmedzenia";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "Reťazec bitov";

/* No comment provided by engineer. */
"bits" = "bitov";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "Reťazec bajtov";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "bajtov";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "Kompromitovanie CA";

/* X.509 key usage bitfield name */
"Cert Sign" = "Podpis cert.";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "Certifikačná autorita";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "Udržovanie certifikátu";

/* Certificate Policies extension label */
"Certificate Policies" = "Pravidlá certifikátu";

/* No comment provided by engineer. */
"Certificate Type" = "Typ certifikátu";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "Prerušenie operácie";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "Kritický";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "Distribučné body CRL";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "Vydavateľ CRL";

/* X.509 key usage bitfield name */
"CRL Sign" = "CRL podpis";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "Dáta";

/* X.509 key usage bitfield name */
"Data Encipherment" = "Kódovanie dát";

/* X.509 key usage bitfield name */
"Decipher Only" = "Len dekódovať";

/* X.509 key usage bitfield name */
"Digital Signature" = "Digitálny podpis";

/* label for general name field value */
"Directory Name" = "Názov adresára";

/* label for general name field value */
"DNS Name" = "Názov DNS";

/* label for general name field value */
"EDI Party Name" = "Názov EDI strany";

/* label for general name field value */
"Email Address" = "Emailová adresa";

/* X.509 key usage bitfield name */
"Encipher Only" = "Len zakódovať";

/* No comment provided by engineer. */
"Expired" = "Vypršal";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "Vyprší";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "Explicitný text";

/* Extended key usage extension label */
"Extended Key Usage" = "Rozšírené použitie kľúča";

/* Label used for General Name entry when value is invalid */
"General Name" = "Všeobecné meno";

/* Label used for General Names when value is invalid */
"General Names" = "Všeobecné mená";

/* No comment provided by engineer. */
"Hostname mismatch." = "Nezhoda mena hosta.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "Zabrániť mapovaniu pravidiel";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "Neplatný %@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "Neplatná väzba reťaze certifikátov.";

/* label for general name field value */
"IP Address" = "IP adresa";

/* No comment provided by engineer. */
"Issued By" = "Vydaný:";

/* No comment provided by engineer. */
"Issuer Name" = "Meno vydavateľa";

/* No comment provided by engineer. */
"Issuer Summary" = "Zhrnutie vydavateľa";

/* No comment provided by engineer. */
"Issuer Unique ID" = "Jedinečné ID vydavateľa";

/* X.509 key usage bitfield name */
"Key Agreement" = "Dohoda kľúčov";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "Kompromitovanie kľúča";

/* X.509 key usage bitfield name */
"Key Encipherment" = "Kódovanie kľúča";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "Identifikátor kľúča";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "Meno relatívne pre vydavateľa CRL";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "Nie";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "Non-Repudiation";

/* field value of parameters field when no parameters are present */
"none" = "žiadny";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "nezobrazený (tag = %1$@; dĺžka %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "Neplatný po";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "Neplatný pred";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "Čísla oznamov";

/* Netscape certificate type usage value */
"Object Signing" = "Object Signing";

/* Netscape certificate type usage value */
"Object Signing CA" = "Object Signing CA";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "Oid je príliš dlhé";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "Jeden alebo viac certifikátov vypršalo, alebo zatiaľ nie sú platné.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "Našlo sa jedno alebo viac nepodporovaných rozšírení.";

/* Label of field in Certificate Policies extension */
"Organization" = "Organizácia";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "Iné meno";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "Parametre";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "Obmedzenie dĺžky cesty";

/* Policy constraints extension label */
"Policy Constraints" = "Obmedzenia pravidiel";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "Identifikátor pravidla #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "Kvalifikátor pravidla #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "Požiadavky pravidiel nesplnené.";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "Doba používania privátneho kľúča";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "Právo odobrané";

/* No comment provided by engineer. */
"Public Key Algorithm" = "Algoritmus verejného kľúča";

/* No comment provided by engineer. */
"Public Key Data" = "Dáta verejného kľúča";

/* Label of field in extended key usage extension */
"Purpose" = "Účel";

/* Label of field in Certificate Policies extension */
"Qualifier" = "Kvalifikátor";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "Príčiny";

/* label for general name field value */
"Registered ID" = "Registrované ID";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "Vyžadovať jasné pravidlá";

/* Netscape certificate type usage value */
"Reserved" = "Rezervovaný";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "Koreňový certifikát je nedôveryhodný.";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "Sekvencia";

/* No comment provided by engineer. */
"Serial Number" = "Sériové číslo";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "Nastaviť";

/* No comment provided by engineer. */
"Signature" = "Podpis";

/* No comment provided by engineer. */
"Signature Algorithm" = "Algoritmus podpisu";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "SSL klient";

/* Netscape certificate type usage value */
"SSL server" = "SSL server";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "Identifikátor kľúča subjektu";

/* No comment provided by engineer. */
"Subject Name" = "Meno subjektu";

/* No comment provided by engineer. */
"Subject Unique ID" = "Jedinečné ID subjektu";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "Nahradený";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "Tento certifikát má vydavateľa, ktorý vypršal";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "Tento certifikát má vydavateľa, ktorý zatiaľ nie je platný";

/* No comment provided by engineer. */
"This certificate has expired" = "Certifikátu vypršala platnosť";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "Tento certifikát zatiaľ nie je platný";

/* The certificate is temporally valid */
"This certificate is valid" = "Tento certifikát je platný";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "Neanalyzovaný %@";

/* CRL Distribution Points extension supported reason name */
"Unused" = "Nepoužívaný";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "Použitie";

/* No comment provided by engineer. */
"Valid from" = "Platný od";

/* No comment provided by engineer. */
"Version" = "Verzia";

/* label for general name field value */
"X.400 Address" = "Adresa X.400";

/* Label of a X.501 Name */
"X.501 Name" = "X.501 meno";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "X.509 verzia %1$d %2$scertifikát";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "Áno";

